---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalFixityState
source: html/2bb0f017-c647-e476-6d54-68dabf41e81b.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalFixityState

Specifies the fixity setting of individual degrees of freedom in analytical release conditions.

## Syntax (C#)
```csharp
public enum AnalyticalFixityState
```